'''
     *
    * *    前面的空格：层数-1，层数-2...    中间的空格：1、3、5
   *   *
  *     *
 *       *
  *     *  前面的空格：1、2、3...   中间的空格：层数*2-5、层数*2-7
   *   *
    * *
     *
'''

N = 3
#打印上面的一半
for i in range(N):
    #第一行
    if i == 0:
        print(' ' * (N -1 -i) + '*')
    else:
        s = ' ' * (N - 1 - i) + '*' + (i * 2 - 1) * ' ' + '*'
        print(s)
#打印下面的一半
for i in range(N - 1):
    #最后一行
    if  i == N - 2:
        print(' ' * (N - 1) + '*')
    else:
        s = ' ' * (i + 1) + '*' + (N * 2 - 5 - 2 * i) * ' ' + '*'
        print(s)